src/main/java/ok/dht/test/yasevich/profiling/stage4/wrk/wrk-put-report4
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 7.827ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 7.880ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 7.945ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 7.827ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 7.950ms, rate sampling interval: 38ms
  Thread calibration: mean lat.: 7.877ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 7.736ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 7.785ms, rate sampling interval: 36ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.75ms   13.92ms 113.98ms   88.04%
    Req/Sec     1.77k   297.90     3.00k    72.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.00ms
 75.000%   14.93ms
 90.000%   28.46ms
 99.000%   71.55ms
 99.900%   98.56ms
 99.990%  106.50ms
 99.999%  112.58ms
100.000%  114.05ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.110     0.000000            1         1.00
       1.375     0.100000        69969         1.11
       2.121     0.200000       139903         1.25
       3.317     0.300000       209852         1.43
       4.983     0.400000       279806         1.67
       6.995     0.500000       349809         2.00
       8.207     0.550000       384732         2.22
       9.535     0.600000       419819         2.50
      10.991     0.650000       454644         2.86
      12.727     0.700000       489625         3.33
      14.927     0.750000       524584         4.00
      16.359     0.775000       542156         4.44
      18.031     0.800000       559585         5.00
      19.919     0.825000       577150         5.71
      22.111     0.850000       594590         6.67
      24.959     0.875000       612009         8.00
      26.655     0.887500       620810         8.89
      28.463     0.900000       629503        10.00
      30.591     0.912500       638254        11.43
      33.247     0.925000       647048        13.33
      36.319     0.937500       655802        16.00
      37.887     0.943750       660138        17.78
      39.647     0.950000       664541        20.00
      41.567     0.956250       668868        22.86
      43.967     0.962500       673241        26.67
      47.007     0.968750       677594        32.00
      49.055     0.971875       679794        35.56
      51.231     0.975000       681971        40.00
      53.983     0.978125       684147        45.71
      57.215     0.981250       686331        53.33
      61.663     0.984375       688511        64.00
      64.063     0.985938       689607        71.11
      66.879     0.987500       690705        80.00
      69.823     0.989062       691797        91.43
      72.575     0.990625       692880       106.67
      75.455     0.992188       693988       128.00
      76.991     0.992969       694520       142.22
      78.719     0.993750       695076       160.00
      80.447     0.994531       695611       182.86
      82.431     0.995313       696167       213.33
      85.119     0.996094       696705       256.00
      86.463     0.996484       696983       284.44
      88.063     0.996875       697251       320.00
      90.047     0.997266       697529       365.71
      92.031     0.997656       697802       426.67
      94.079     0.998047       698071       512.00
      94.975     0.998242       698212       568.89
      95.999     0.998437       698349       640.00
      97.087     0.998633       698481       731.43
      97.855     0.998828       698624       853.33
      98.687     0.999023       698758      1024.00
      99.199     0.999121       698824      1137.78
      99.647     0.999219       698898      1280.00
     100.095     0.999316       698967      1462.86
     100.799     0.999414       699028      1706.67
     101.503     0.999512       699095      2048.00
     101.951     0.999561       699130      2275.56
     102.335     0.999609       699168      2560.00
     102.783     0.999658       699200      2925.71
     103.167     0.999707       699232      3413.33
     103.743     0.999756       699266      4096.00
     104.191     0.999780       699283      4551.11
     104.511     0.999805       699300      5120.00
     104.959     0.999829       699320      5851.43
     105.407     0.999854       699336      6826.67
     105.983     0.999878       699351      8192.00
     106.303     0.999890       699361      9102.22
     106.559     0.999902       699368     10240.00
     107.647     0.999915       699377     11702.86
     108.607     0.999927       699385     13653.33
     109.631     0.999939       699394     16384.00
     110.143     0.999945       699398     18204.44
     110.655     0.999951       699402     20480.00
     110.911     0.999957       699407     23405.71
     111.231     0.999963       699411     27306.67
     111.487     0.999969       699415     32768.00
     111.615     0.999973       699417     36408.89
     111.743     0.999976       699419     40960.00
     111.999     0.999979       699422     46811.43
     112.127     0.999982       699424     54613.33
     112.447     0.999985       699427     65536.00
     112.447     0.999986       699427     72817.78
     112.575     0.999988       699430     81920.00
     112.575     0.999989       699430     93622.86
     112.575     0.999991       699430    109226.67
     112.831     0.999992       699431    131072.00
     113.279     0.999993       699433    145635.56
     113.279     0.999994       699433    163840.00
     113.279     0.999995       699433    187245.71
     113.279     0.999995       699433    218453.33
     113.535     0.999996       699434    262144.00
     113.535     0.999997       699434    291271.11
     113.535     0.999997       699434    327680.00
     113.727     0.999997       699435    374491.43
     113.727     0.999998       699435    436906.67
     113.727     0.999998       699435    524288.00
     113.727     0.999998       699435    582542.22
     113.727     0.999998       699435    655360.00
     114.047     0.999999       699436    748982.86
     114.047     1.000000       699436          inf
#[Mean    =       11.751, StdDeviation   =       13.924]
#[Max     =      113.984, Total count    =       699436]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  839758 requests in 1.00m, 53.66MB read
Requests/sec:  13995.83
Transfer/sec:      0.89MB